<?php

namespace App\Constants;

class ENUM
{

    // Marital Status
    const Marital = ['married'];
    const SINGLE = 'single';


    // Gender Preferred
    const STATUS = ['1'=>'تحت التقييم','2'=>'تم التقييم وبانتظار الموافقه','3'=>'الطلب بحتاج تعديل','4'=>'مرفوض','5'=>'الطلب مقبول'];
    const CATEGROY = ['1'=>'افراد','2'=>'قطاع عام','3'=>'قطاع خاص','4'=>'جهات خيريه'];
    const Gender = ['ذكر','انثى'];
    const Nationality = ([
        'سعودي', 'مصري', 'لبناني', 'سوري', 'فلسطيني', 'أمريكي', 'كندي', 'برازيلي',
        'ألماني', 'فرنسي', 'إيطالي', 'إسباني', 'ياباني', 'صيني', 'روسي', 'هندي',
        'باكستاني', 'تركي', 'إيراني', 'أفغاني', 'عراقي', 'يمني', 'إماراتي', 'قطري',
        'كويتي', 'عماني', 'أردني', 'ليبي', 'تونسي', 'مغربي', 'سوداني', 'جزائري',
        'تشادي', 'نيجيري', 'جنوب إفريقي', 'كيني', 'ماليزي', 'أسترالي', 'نيوزيلندي',
        'هولندي', 'بلجيكي', 'سويدي', 'نرويجي', 'دنماركي', 'فنلندي', 'روماني', 'يوناني',
        'سويسري', 'بلغاري', 'هنغاري', 'بولندي', 'تشيكي', 'سلوفاكي', 'كرواتي', 'صربي',
        'بوسني', 'كوسوفي', 'مقدوني', 'ألباني', 'أوكراني', 'بيلاروسي', 'إستوني', 'لاتفي',
        'ليتواني', 'مولدوفي', 'جورجي', 'أرميني', 'أذربيجاني', 'قرغيزي', 'قازاخستاني',
        'أوزبكي', 'تاجيكي', 'تركماني', 'بنغالي', 'سريلانكي', 'فيتنامي', 'تايلاندي',
        'ماليزي', 'إندونيسي', 'فلبيني', 'كمبودي', 'لاوسي', 'ميانماري', 'كوري جنوبي',
        'كوري شمالي', 'منغولي', 'نيبالي', 'بوتاني', 'بحريني', 'إيموراتي', 'جيبوتي',
        'صومالي', 'إريتري', 'أثيوبي', 'سوداني', 'تشادي', 'موريتاني',
        'موريتاني', 'مالي'
    ]);

    const countries = [
        'الإمارات العربية المتحدة',
        'المملكة العربية السعودية',
        'قطر',
        'عمان',
        'الكويت',
        'البحرين',
    ];

    const cities = [
        'الإمارات العربية المتحدة' => ['دبي', 'أبوظبي', 'الشارقة', 'عجمان', 'رأس الخيمة'],
        'المملكة العربية السعودية' => ['الرياض', 'جدة', 'الدمام', 'الخبر', 'مكة المدينة'],
        'قطر' => ['الدوحة', 'الوكرة', 'الخور', 'الريان', 'الشمال'],
        'عمان' => ['مسقط', 'صلالة', 'صحار', 'نزوى', 'صور'],
        'الكويت' => ['الكويت', 'الفروانية', 'الأحمدي', 'حولي', 'الجهراء'],
        'البحرين' => ['المنامة', 'الرفاع', 'المحرق', 'عيسى', 'مدينة حمد'],
    ];

    const courses = [
        'الكفاءة المتوسطة',
        'برنامج إعدادي',
        'دبلوم',
        'درجة الدكتوراه',
        'درجة الماجستير',
        'درجة البكالوريوس',
        'الإبتدائية',
        'الثانوية',
        'أخرى',
    ];

    const sections = [
        'قطاع افراد',
        'قطاع عام',
        'قطاع خاص',
        'جمعيه خيريه',
    ];


    const ADMIN_ROLE = 'admin';


    // Reservation Status

    const NEW_RESERVATION = 'new';
    const COMPLETED_RESERVATION = 'completed';
    const CANCELED_RESERVATION = 'canceled';

    // Reservation Cancel Status

    const NEW_RESERVATION_CANCEL = 'new';
    const COMPLETED_RESERVATION_CANCEL = 'completed';

    const REJECT_RESERVATION_CANCEL = 'reject';
    const ACCEPT_RESERVATION_CANCEL = 'accept';

}

